In [1]:
import pandas as pd
from math import sqrt

In [2]:
players = {'Height':[175,177,178,181,182,183,184,188,190],'Experience':[4,6,3,2,6,3,7,2,6],'Salary':[12,18,15,16,24,20,28,24,32]}

In [3]:
df = pd.DataFrame(players)

In [4]:
df

   Height  Experience  Salary
0     175           4      12
1     177           6      18
2     178           3      15
3     181           2      16
4     182           6      24
5     183           3      20
6     184           7      28
7     188           2      24
8     190           6      32


# Mean Model

In [5]:
(df.Salary-df.Salary.mean()).pow(2).sum()

340.0

# First Division

In [6]:
filt = (df.Height <= 180)
df1 = df[filt]
df2 = df[~filt]

In [7]:
df1

   Height  Experience  Salary
0     175           4      12
1     177           6      18
2     178           3      15

In [8]:
df2

   Height  Experience  Salary
3     181           2      16
4     182           6      24
5     183           3      20
6     184           7      28
7     188           2      24
8     190           6      32

# First Division ; Error Rate

In [9]:
(df1.Salary - df1.Salary.mean()).pow(2).sum() + (df2.Salary - df2.Salary.mean()).pow(2).sum()

178.0


# Second Division

In [10]:
filt2 = (df2.Height <= 185)
df3 = df2[filt2]
df4 = df2[~filt2]

In [11]:
df3

   Height  Experience  Salary
3     181           2      16
4     182           6      24
5     183           3      20
6     184           7      28

In [12]:
df4

   Height  Experience  Salary
7     188           2      24
8     190           6      32


# Second Division; Error Rate

In [13]:
(df1.Salary - df1.Salary.mean()).pow(2).sum() + (df4.Salary - df4.Salary.mean()).pow(2).sum() + (df3.Salary - df3.Salary.mean()).pow(2).sum()

130.0


# Third Division

In [14]:
filt3 = (df3.Experience <= 5)
df5 = df3[filt3]
df6 = df3[~filt3]

In [15]:
df5

   Height  Experience  Salary
3     181           2      16
5     183           3      20

In [16]:
df6

   Height  Experience  Salary
4     182           6      24
6     184           7      28


# Third Division; Error Rate

In [17]:
(df1.Salary - df1.Salary.mean()).pow(2).sum() + (df4.Salary - df4.Salary.mean()).pow(2).sum() + (df5.Salary - df5.Salary.mean()).pow(2).sum() + (df6.Salary - df6.Salary.mean()).pow(2).sum()

66.0